openwch/ch32m030/EVT/EXAM/SRC/Peripheral/src/ch32m030_adc.c
    tmpreg = ADCx->CTLR1;
    tmpreg &= CTLR1_AWDCH_Reset;
    tmpreg |= ADC_Channel;
    ADCx->CTLR1 = tmpreg;
}

/*********************************************************************
 * @fn      ADC_GetFlagStatus
 *
 * @brief   Checks whether the specified ADC flag is set or not.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          ADC_FLAG - specifies the flag to check.
 *            ADC_FLAG_AWD - Analog watchdog flag.
 *            ADC_FLAG_EOC - End of conversion flag.
 *            ADC_FLAG_JEOC - End of injected group conversion flag.
 *            ADC_FLAG_JSTRT - Start of injected group conversion flag.
 *            ADC_FLAG_STRT - Start of regular group conversion flag.
 *            ADC_FLAG_AWD_OV - Analog watchdog overflow event flag.
 *            ADC_FLAG_AWD_DN - Analog watchdog underflow event flag
 *            ADC_FLAG_MULT_CMP1 - Multi threshold comparison result 3.
 *            ADC_FLAG_MULT_CMP2 - Multi threshold comparison result 2.
 *            ADC_FLAG_MULT_CMP3 - Multi threshold comparison result 1.
 *            ADC_FLAG_AVG_OVI - In the move average function,the conversion value overflow interrupt flag.
 *            ADC_FLAG_AVG_DNI - In the move average function,the conversion value underflow interrupt flag.
 *            ADC_FLAG_AVG_OV - In the move average function,the conversion value overflow flag.
 *            ADC_FLAG_AVG_DN - In the move average function,the conversion value underflow flag.
 *
 * @return  FlagStatus: SET or RESET.
 */
FlagStatus ADC_GetFlagStatus(ADC_TypeDef *ADCx, uint32_t ADC_FLAG)
{
    FlagStatus bitstatus = RESET;

    uint32_t flagmask = 0;

    flagmask = ADC_FLAG & 0x0FFFFFFF;

    if((ADC_FLAG & 0xF000000) != 0)
    {
        if((ADCx->CTLR3 & flagmask) != (uint8_t)RESET)
        {
            bitstatus = SET;
        }
        else
        {
            bitstatus = RESET;
        }
    }
    else
    {
        if((ADCx->STATR & flagmask) != (uint8_t)RESET)
        {
            bitstatus = SET;
        }
        else
        {
            bitstatus = RESET;
        }
    }

    return bitstatus;
}

/*********************************************************************
 * @fn      ADC_ClearFlag
 *
 * @brief   Clears the ADCx's pending flags.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          ADC_FLAG - specifies the flag to clear.
 *            ADC_FLAG_AWD - Analog watchdog flag.
 *            ADC_FLAG_EOC - End of conversion flag.
 *            ADC_FLAG_JEOC - End of injected group conversion flag.
 *            ADC_FLAG_JSTRT - Start of injected group conversion flag.
 *            ADC_FLAG_STRT - Start of regular group conversion flag.
 *            ADC_FLAG_AVG_OVI - In the move average function,the conversion value overflow interrupt flag.
 *            ADC_FLAG_AVG_DNI - In the move average function,the conversion value underflow interrupt flag.
 * @return  none
 */
void ADC_ClearFlag(ADC_TypeDef *ADCx, uint32_t ADC_FLAG)
{
    uint32_t flagmask = 0;
    flagmask = ADC_FLAG & 0x0FFFFFFF;

    ADCx->STATR = ~(uint32_t)flagmask;
}

/*********************************************************************
 * @fn      ADC_GetITStatus
 *
 * @brief   Checks whether the specified ADC interrupt has occurred or not.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          ADC_IT - specifies the ADC interrupt source to check.
 *            ADC_IT_EOC - End of conversion interrupt mask.
 *            ADC_IT_AWD - Analog watchdog interrupt mask.
 *            ADC_IT_JEOC - End of injected conversion interrupt mask.
 *            ADC_IT_AWD_OV - Analog watchdog overflow interrupt mask.
 *            ADC_IT_AWD_DN - Analog watchdog underflow interrupt mask.
 *            ADC_IT_AVG_OV - Moving average overflow interrupt mask.
 *            ADC_IT_AVG_DN - Moving average underflow interrupt mask.
 *
 * @return  ITStatus: SET or RESET.
 */
ITStatus ADC_GetITStatus(ADC_TypeDef *ADCx, uint32_t ADC_IT)
{
    ITStatus bitstatus = RESET;
    uint32_t itmask = 0, tmp = 0 ,tmp1 = 0 , tmpmask = 0, enablestatus = 0;

    tmp = ADC_IT & ADC_IT_Mask;
    tmp1 = (ADC_IT & 0x00F00000) >> 20;
    tmpmask = (ADC_IT & 0x000F0000) >> 16;

    itmask = (uint32_t)(tmp << (16*tmpmask));

    if((ADC_IT & 0xF0000000) != 0)
    {
        enablestatus = (ADCx->CTLR3 & itmask);
        if(((ADCx->CTLR3  & (uint32_t)(tmp << tmp1)) != (uint32_t)RESET) && enablestatus)
        {
            bitstatus = SET;
        }
        else
        {
            bitstatus = RESET;
        }
    }
    else
    {
        enablestatus = (ADCx->CTLR1 & itmask);
        if(((ADCx->STATR  & (uint32_t)(tmp >> tmp1)) != (uint32_t)RESET) && enablestatus)
        {
            bitstatus = SET;
        }
        else
        {
            bitstatus = RESET;
        }
    }

    return bitstatus;
}

/*********************************************************************
 * @fn      ADC_ClearITPendingBit
 *
 * @brief   Clears the ADCx's interrupt pending bits.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          ADC_IT - specifies the ADC interrupt pending bit to clear.
 *            ADC_IT_EOC - End of conversion interrupt mask.
 *            ADC_IT_AWD - Analog watchdog interrupt mask.
 *            ADC_IT_JEOC - End of injected conversion interrupt mask.
 *            ADC_IT_AWD_OV - Analog watchdog overflow interrupt mask.
 *            ADC_IT_AWD_DN - Analog watchdog underflow interrupt mask.
 *            ADC_IT_AVG_OV - Moving average overflow interrupt mask.
 *            ADC_IT_AVG_DN - Moving average underflow interrupt mask.
 *
 * @return  none
 */
void ADC_ClearITPendingBit(ADC_TypeDef *ADCx, uint32_t ADC_IT)
{
    uint32_t itmask = 0, tmp = 0 ,tmp1 = 0;

    tmp = ADC_IT & ADC_IT_Mask;
    tmp1 = (ADC_IT & 0x00F00000) >> 20;

    if((ADC_IT & 0xF0000000) != 0)
    {
        itmask = (uint32_t)(tmp << tmp1);
    }
    else
    {
        itmask = (uint32_t)(tmp >> tmp1);
    }
    ADCx->STATR = ~itmask;
}

/*********************************************************************
 * @fn      ADC_BufferCmd
 *
 * @brief   Enables or disables the ADCx buffer.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_BufferCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR1 |= (1 << 26);
    }
    else
    {
        ADCx->CTLR1 &= ~(1 << 26);
    }
}

/*********************************************************************
 * @fn      ADC_MULTCmpCmd
 *
 * @brief   Enables or disables the Multi-threshold comparison function.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_MULTCmpCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR1 |= (1 << 31);
    }
    else
    {
        ADCx->CTLR1 &= ~(1 << 31);
    }
}

/*********************************************************************
 * @fn      ADC_GetAnalogWatchdogFlagStatus
 *
 * @brief   Checks whether the specified ADC Analog Watchdog flag is set or not.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          AnalogWatchdog_FLAG - specifies the Analog watchdog flag to check.
 *            ADC_AnalogWatchdog_0_FLAG - Analog watchdog 0 flag.
 *            ADC_AnalogWatchdog_1_FLAG - Analog watchdog 1 flag.
 *            ADC_AnalogWatchdog_2_FLAG - Analog watchdog 2 flag.
 *
 * @return  FlagStatus: SET or RESET.
 */
FlagStatus ADC_GetAnalogWatchdogFlagStatus(ADC_TypeDef *ADCx, uint32_t AnalogWatchdog_FLAG)
{
    FlagStatus bitstatus = RESET;

    if((ADCx->CTLR3 & AnalogWatchdog_FLAG) != (uint8_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

