openwch/ch32m030/EVT/EXAM/SRC/Peripheral/src/ch32m030_adc.c
    return bitstatus;
}

/*********************************************************************
 * @fn      ADC_ClearAnalogWatchdogFlag
 *
 * @brief   Clears the ADCx's pending Analog Watchdog flags.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          AnalogWatchdog_FLAG - specifies the Analog watchdog flag to check.
 *            ADC_AnalogWatchdog_0_FLAG - Analog watchdog 0 flag.
 *            ADC_AnalogWatchdog_1_FLAG - Analog watchdog 1 flag.
 *            ADC_AnalogWatchdog_2_FLAG - Analog watchdog 2 flag.
 *
 * @return  none
 */
void ADC_ClearAnalogWatchdogFlag(ADC_TypeDef *ADCx, uint32_t AnalogWatchdog_FLAG)
{
    ADCx->CTLR3 &= ~(uint32_t)AnalogWatchdog_FLAG;
}

/*********************************************************************
 * @fn      ADC_AnalogWatchdogResetCmd
 *
 * @brief   Enables or disables the analog watchdog reset
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          ADC_AnalogWatchdog_x -  Analog watchdog X.
 *            ADC_AnalogWatchdog_0_RST_EN.
 *            ADC_AnalogWatchdog_1_RST_EN.
 *            ADC_AnalogWatchdog_2_RST_EN.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_AnalogWatchdogResetCmd(ADC_TypeDef *ADCx, uint32_t ADC_AnalogWatchdog_x, FunctionalState NewState)
{
  if(NewState != DISABLE)
  {
      ADCx->CTLR3 |= ADC_AnalogWatchdog_x;
  }
  else
  {
      ADCx->CTLR3 &= ~ADC_AnalogWatchdog_x;
  }
}

/*********************************************************************
 * @fn      ADC_AnalogWatchdogScanCmd
 *
 * @brief   Enable ADC clock duty cycle adjustment.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_AnalogWatchdogScanCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR3 |= (1<<3);
    }
    else
    {
        ADCx->CTLR3 &= ~(1<<3);
    }
}

/*********************************************************************
 * @fn      ADC_RegularChannelIndicationCmd
 *
 * @brief   Enable ADC regular data channel indication.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_RegularChannelIndicationCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR3 |= (1 << 7);
    }
    else
    {
        ADCx->CTLR3 &= ~(1 << 7);
    }
}

/*********************************************************************
 * @fn      ADC_ChannelAdvanceSwCmd
 *
 * @brief   Enable ADC sample channel advance switching.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_ChannelAdvanceSwCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR3 &= ~(1 << 0);
    }
    else
    {
        ADCx->CTLR3 |= (1 << 0);
    }
}

/*********************************************************************
 * @fn      ADC_RegularChannelPollSaveCmd
 *
 * @brief   Enable the saving function of ADC regular channel data polling.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_RegularChannelPollSaveCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR3 |= (1 << 27);
    }
    else
    {
        ADCx->CTLR3 &= ~(1 << 27);
    }
}

/*********************************************************************
 * @fn      ADC_CmpareResultXORCmd
 *
 * @brief   Enable ADC comparison result XOR function.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_CmpareResultXORCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR3 |= (1 << 26);
    }
    else
    {
        ADCx->CTLR3 &= ~(1 << 26);
    }
}

/*********************************************************************
 * @fn      ADC_MovingAverageCmd
 *
 * @brief  Enable ADC moving average function.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_MovingAverageCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR3 |= (1 << 23);
    }
    else
    {
        ADCx->CTLR3 &= ~(1 << 23);
    }
}

/*********************************************************************
 * @fn      ADC_MovingAverageWindowSizeConfig
 *
 * @brief  Set ADC moving average window value
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          ADC_MoveSize - ADC moving window size.
 *          ADC_MovingWindow_Size_32 - The average value obtained by ADC sampling 32 data points.
 *          ADC_MovingWindow_Size_64 -The average value obtained by ADC sampling 64 data points
 *          ADC_MovingWindow_Size_128 - The average value obtained by ADC sampling 128 data points.
 *          ADC_MovingWindow_Size_256 - The average value obtained by ADC sampling 256 data points
 *          ADC_MovingWindow_Size_512 - The average value obtained by ADC sampling 512 data points
 *          ADC_MovingWindow_Size_1024 - The average value obtained by ADC sampling 1024 data points
 *
 * @return  none
 */
void ADC_MovingAverageWindowSizeConfig(ADC_TypeDef *ADCx, uint32_t ADC_MoveSize)
{
    uint32_t tmpreg1 = 0;
    tmpreg1 = ADCx->CTLR3;
    tmpreg1 &= (uint32_t)0xFF8FFFFF;
    tmpreg1 |= ADC_MoveSize;
    ADCx->CTLR3 = tmpreg1;
}

/*********************************************************************
 * @fn      ADC_AverageValueThresholdsConfig
 *
 * @brief   Configures the high and low thresholds of the analog watchdog.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          HighThreshold - the ADC analog watchdog High threshold value.
 *            This parameter must be a 12bit value.
 *          LowThreshold - the ADC analog watchdog Low threshold value.
 *            This parameter must be a 12bit value.
 *
 * @return  none
 */
void ADC_AverageValueThresholdsConfig(ADC_TypeDef *ADCx, uint16_t HighThreshold,
                                        uint16_t LowThreshold)
{
    ADCx->AVGTR = (uint32_t)HighThreshold<<16;
    ADCx->AVGTR |= (uint32_t)LowThreshold;
}

/*********************************************************************
 * @fn      ADC_ExternalTrig_DLY
 *
 * @brief   ADC external trigger sources delay channels and time.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          channel - ADC external trigger sources delay channels.
 *            ADC_ExternalTrigRegul_DLY - External trigger sources regular.
 *            ADC_ExternalTrigInjec_DLY - External trigger sources injected.
 *          DelayTim - ADC external trigger sources delay time
 *              This parameter must range from 0 to 0x1FF.
 *
 * @return  none
 */
void ADC_ExternalTrig_DLY(ADC_TypeDef *ADCx, uint32_t channel, uint16_t DelayTim)
{
    ADCx->DLYR &= ~(uint32_t)(0x3FF);
    ADCx->DLYR |= channel;
    ADCx->DLYR |= DelayTim;
}

/*********************************************************************
 * @fn      ADC_GetAverageValue
 *
 * @brief   Returns the last ADCx average value result .
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *
 * @return  ADCx->AVGDR - The Data average value.
 */
uint16_t ADC_GetAverageValue(ADC_TypeDef *ADCx)
{
    return (uint16_t)ADCx->AVGDR;
}

/*********************************************************************
 * @fn      ADC_GetConversionValue2
 *
 * @brief   Returns the last ADCx conversion result data for regular channel 2.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *
 * @return  ADCx->RDATAR2 - The Data conversion value from channel 2.
 */
uint16_t ADC_GetConversionValue2(ADC_TypeDef *ADCx)
{
    return (uint16_t)ADCx->RDATAR2;
}

/*********************************************************************
 * @fn      ADC_GetConversionValue3
 *
 * @brief   Returns the last ADCx conversion result data for regular channel 3.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *
 * @return  ADCx->RDATAR - The Data conversion value from channel 3.
 */
uint16_t ADC_GetConversionValue3(ADC_TypeDef *ADCx)
{
    return (uint16_t)ADCx->RDATAR3;
}

/*********************************************************************
 * @fn      ADC_GetConversionValue4
 *
 * @brief   Returns the last ADCx conversion result data for regular channel 4.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *
 * @return  ADCx->RDATAR - The Data conversion value from channel 4.
 */
uint16_t ADC_GetConversionValue4(ADC_TypeDef *ADCx)
{
    return (uint16_t)ADCx->RDATAR4;
}
